In [1]:
import pandas as pd
import numpy as np

In [2]:
#Read datasets
usa_data = pd.read_csv('usa_sales.csv')
can_data = pd.read_csv('canada_sales.csv')

In [3]:
usa_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,236670,Wired Headphones,2,11.99,08/31/19 22:21,"359 Spruce St, Seattle, WA 98101"
1,236671,Bose SoundSport Headphones,1,99.99,08/15/19 15:11,"492 Ridge St, Dallas, TX 75001"
2,236672,iPhone,1,700.0,08/06/19 14:40,"149 7th St, Portland, OR 97035"
3,236673,AA Batteries (4-pack),2,3.84,08/29/19 20:59,"631 2nd St, Los Angeles, CA 90001"
4,236674,AA Batteries (4-pack),2,3.84,08/15/19 19:53,"736 14th St, New York City, NY 10001"

In [4]:
can_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"128 Elm St, Quebec City"
1,NaN,NaN,NaN,NaN,NaN,"113 Oak St, Ottawa"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"116 Elm St, Winnipeg"
3,176560,Google Phone,1,600,04/12/19 14:38,"149 Broadway, Edmonton"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"121 Maple St, Vancouver"

In [5]:
usa_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12011 entries, 0 to 12010
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          11983 non-null  object
 1   Product           11983 non-null  object
 2   Quantity Ordered  11983 non-null  object
 3   Price Each        11983 non-null  object
 4   Order Date        11983 non-null  object
 5   Purchase Address  11983 non-null  object
dtypes: object(6)
memory usage: 563.1+ KB

In [6]:
can_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18383 entries, 0 to 18382
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          18324 non-null  object
 1   Product           18324 non-null  object
 2   Quantity Ordered  18324 non-null  object
 3   Price Each        18324 non-null  object
 4   Order Date        18324 non-null  object
 5   Purchase Address  18383 non-null  object
dtypes: object(6)
memory usage: 861.8+ KB

In [7]:
can_data.dropna(inplace=True)

In [8]:
can_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18324 entries, 0 to 18382
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          18324 non-null  object
 1   Product           18324 non-null  object
 2   Quantity Ordered  18324 non-null  object
 3   Price Each        18324 non-null  object
 4   Order Date        18324 non-null  object
 5   Purchase Address  18324 non-null  object
dtypes: object(6)
memory usage: 1002.1+ KB

In [9]:
can_data['Price Each'].unique()

array(['11.95', '99.99', '600', '11.99', '1700', '14.95', '389.99',
       '3.84', '150', '2.99', '700', '300', '149.99', '109.99', '600.0',
       '999.99', '400', '379.99', 'Price Each'], dtype=object)

In [10]:
usa_data['Price Each'].unique()

array(['11.99', '99.99', '700.0', '3.84', '379.99', '109.99', '1700.0',
       '600.0', '149.99', '14.95', '150.0', '2.99', '11.95', '389.99',
       '999.99', '300.0', '400.0', 'Price Each', '600', '150', '1700',
       '300', '400', '700', nan], dtype=object)

In [11]:
can_data[can_data['Price Each'] == 'Price Each'].count()

Order ID            35
Product             35
Quantity Ordered    35
Price Each          35
Order Date          35
Purchase Address    35
dtype: int64

In [12]:
usa_data[usa_data['Price Each'] == 'Price Each'].count()

Order ID            26
Product             26
Quantity Ordered    26
Price Each          26
Order Date          26
Purchase Address    26
dtype: int64

In [13]:
#Drop columns where data of Price Each is 'Price Each'
usa_data.drop(usa_data[usa_data['Price Each'] == 'Price Each'].index, inplace=True)
can_data.drop(can_data[can_data['Price Each'] == 'Price Each'].index, inplace=True)

In [14]:
usa_data['Price Each'].unique()
usa_data.drop(usa_data[usa_data['Price Each'] == 'nan'].index, inplace=True)

In [15]:
usa_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11985 entries, 0 to 12010
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          11957 non-null  object
 1   Product           11957 non-null  object
 2   Quantity Ordered  11957 non-null  object
 3   Price Each        11957 non-null  object
 4   Order Date        11957 non-null  object
 5   Purchase Address  11957 non-null  object
dtypes: object(6)
memory usage: 655.4+ KB

In [16]:
can_data['Price Each'].unique()

array(['11.95', '99.99', '600', '11.99', '1700', '14.95', '389.99',
       '3.84', '150', '2.99', '700', '300', '149.99', '109.99', '600.0',
       '999.99', '400', '379.99'], dtype=object)

In [17]:
can_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18289 entries, 0 to 18382
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          18289 non-null  object
 1   Product           18289 non-null  object
 2   Quantity Ordered  18289 non-null  object
 3   Price Each        18289 non-null  object
 4   Order Date        18289 non-null  object
 5   Purchase Address  18289 non-null  object
dtypes: object(6)
memory usage: 1000.2+ KB

In [18]:
can_data['Price Each'] = can_data['Price Each'].astype(float)
usa_data['Price Each'] = usa_data['Price Each'].astype(float)

In [19]:
#Convert Canada Price Each to USD
can_data['Price Each'] = can_data['Price Each'] * 0.75

In [20]:
#Comivine usa and canada data 
pd_combined = pd.concat([usa_data, can_data], axis=0, ignore_index=True)

In [21]:
pd_combined

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,236670,Wired Headphones,2,11.9900,08/31/19 22:21,"359 Spruce St, Seattle, WA 98101"
1,236671,Bose SoundSport Headphones,1,99.9900,08/15/19 15:11,"492 Ridge St, Dallas, TX 75001"
2,236672,iPhone,1,700.0000,08/06/19 14:40,"149 7th St, Portland, OR 97035"
3,236673,AA Batteries (4-pack),2,3.8400,08/29/19 20:59,"631 2nd St, Los Angeles, CA 90001"
4,236674,AA Batteries (4-pack),2,3.8400,08/15/19 19:53,"736 14th St, New York City, NY 10001"
...,...,...,...,...,...,...
30269,194090,Google Phone,1,450.0000,04/08/19 17:11,"124 Market St, Quebec City"
30270,194091,AA Batteries (4-pack),1,2.8800,04/15/19 16:02,"130 Cedar Ave, Ottawa"
30271,194092,AAA Batteries (4-pack),2,2.2425,04/28/19 14:36,"137 Maple St, Vancouver"
30272,194093,AA Batteries (4-pack),1,2.8800,04/14/19 15:09,"133 Elm St, Vancouver"
30273,194094,Lightning Charging Cable,1,11.2125,04/18/19 11:08,"105 Pacific Ave, Toronto"

In [22]:
pd_combined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30274 entries, 0 to 30273
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          30246 non-null  object
 1   Product           30246 non-null  object
 2   Quantity Ordered  30246 non-null  object
 3   Price Each        30246 non-null  float64
 4   Order Date        30246 non-null  object
 5   Purchase Address  30246 non-null  object
dtypes: float64(1), object(5)
memory usage: 1.4+ MB

### Connecting to Database

In [23]:
import os
import sqlalchemy
from dotenv import load_dotenv

load_dotenv()

True

In [24]:
db_url = os.getenv("DATABASE_URL")
conn = sqlalchemy.create_engine(db_url)

In [25]:
pd_combined.to_sql('sales', conn, if_exists='replace', index=False)

274

In [27]:
query = "SELECT * FROM sales LIMIT 5;"
result = pd.read_sql(query, conn)
result

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,236670,Wired Headphones,2,11.99,08/31/19 22:21,"359 Spruce St, Seattle, WA 98101"
1,236671,Bose SoundSport Headphones,1,99.99,08/15/19 15:11,"492 Ridge St, Dallas, TX 75001"
2,236672,iPhone,1,700.00,08/06/19 14:40,"149 7th St, Portland, OR 97035"
3,236673,AA Batteries (4-pack),2,3.84,08/29/19 20:59,"631 2nd St, Los Angeles, CA 90001"
4,236674,AA Batteries (4-pack),2,3.84,08/15/19 19:53,"736 14th St, New York City, NY 10001"